app/models/comment.rb

  def status_change

    self.article.update(status:'public')
---
UPDATE "articles" SET "updated_at" = ?, "status" = ? WHERE "articles"."id" = ?  [["updated_at", "2024-03-20 08:07:43.818651"], ["status", "public"], ["id", 13]]